//app.js
App({
  onLaunch: function () {
    // 展示本地存储能力
    var logs = wx.getStorageSync('logs') || []
    logs.unshift(Date.now())
    wx.setStorageSync('logs', logs)

    // 登录
    wx.login({
      success: res => {
        // 发送 res.code 到后台换取 openId, sessionKey, unionId
      }
    })
    // 获取用户信息
    wx.getSetting({
      success: res => {
        if (res.authSetting['scope.userInfo']) {
          // 已经授权，可以直接调用 getUserInfo 获取头像昵称，不会弹框
          wx.getUserInfo({
            success: res => {
              // 可以将 res 发送给后台解码出 unionId
              this.globalData.userInfo = res.userInfo

              // 由于 getUserInfo 是网络请求，可能会在 Page.onLoad 之后才返回
              // 所以此处加入 callback 以防止这种情况
              if (this.userInfoReadyCallback) {
                this.userInfoReadyCallback(res)
              }
            }
          })
        }
      }
    })
  },
  globalData: {
    userInfo: null,
    //上海分类
    recyclable_trash: ['饮料', '瓶子', '啤酒', "报纸", "纸箱", "书本", "纸塑铝复合包装", "纸袋", "信封", "塑料瓶", "玩具", 
    "油桶", "酒桶", 
    "乳液罐", 
      "食品保鲜盒", "容器", "储物箱", "塑料盒", "一次性餐具",
      "泡沫塑料", "板材", "隔热砖", "保温箱",
      "衣架", 
      "酒瓶", "啤酒", "瓶子", "哈尔滨啤酒", "白酒", "青岛啤酒", "燕京啤酒",
      "玻璃放大镜", "玻璃杯", "窗玻璃", "碎玻璃", "易拉罐", "锅", "螺丝刀", "刀", "指甲钳","指甲刀", "刀片", "皮鞋", "衣服", "床单", "枕头", "皮包",          "毛绒玩具", "电路板", "电线", "插座", "木积木", "砧板","纺织"],

    non_recyclable_trash: ["充电电池", "镍镉电池", "镍镉", "电池", "铅酸电池", "蓄电池", "纽扣电池", "荧光灯", "节能灯", "卤素灯", "过期药物", "药品包        装", "药片", "药品", "过期胶囊药品", "废油漆桶", "化工桶", "染发剂壳", "过期指甲油", "洗甲水", "水银血压计", "水银体温计", "老鼠药", "消毒剂", "        杀虫喷雾", "x光片等感光胶片", "相片底片"],

    dry_trash: ["餐巾纸", "卫生间用纸", "抽纸盒", "卫生纸", "尿不湿", "婴儿尿裤", "丝绸家纺", "狗尿垫", "猫砂", "烟蒂", "污损纸张", "干燥剂",
     "细孔硅胶", "污损塑料", "尼龙制品", "编织袋", "防碎气泡膜", "大骨头", "棒骨", "猪骨头", "硬贝壳", "硬果实", "毛发", "灰土", "炉渣", "橡皮泥", 
     "太空沙", "陶瓷花盆", "带胶制品", "旧毛巾", "内衣裤", "笔", "创可贴", "胶带", "毛巾", "烟头", "眼镜", "笔", "签字笔", "钢笔", "铅笔"],
     
    wet_trash: ["谷物及其加工食品", "肉蛋及其加工食品", "湿垃圾", "食物","水产及其加工食品", "蔬菜", "调料", "酱料", "面包", "动物内脏", "苹果核",
    "鸡蛋及其蛋壳", "鱼", "虾", "干果仁", "大米", "米饭", "鸡肉", "火锅汤底", "鱼骨", "碎骨", "茶叶渣", "咖啡渣", "中药药渣", "糕饼", "糖果", 
      "风干食品", "风干牛肉", "粉末类食品", "宠物饲料", "水果果肉", "水果果皮", "水果茎枝", "果实等", "家养绿植", "花卉", "花瓣", "枝叶", "黄豆",
      "水果", "植物", "花", "麻辣锅", "咖啡豆", "苹果", "多肉植物", "八角茴香", "菜肴", "茶叶"]

  }
})